esch/STM32L052-examples/STM32_nrf/stm32_nrf.cpp
/*
 * This file is part of the libopencm3 project.
 *
 * Copyright (C) 2009 Uwe Hermann <uwe@hermann-uwe.de>
 * Copyright (C) 2011 Stephen Caudle <scaudle@doceme.com>
 * Copyright (C) 2013 Piotr Esden-Tempski <piotr@esden.net>
 *
 * This library is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Lesser General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this library.  If not, see <http://www.gnu.org/licenses/>.
 */

#include <libopencm3/stm32/rcc.h>
#include <libopencm3/stm32/rtc.h>
#include <libopencm3/stm32/adc.h>
#include <libopencm3/stm32/gpio.h>
#include <libopencm3/stm32/usart.h>
#include <libopencm3/cm3/nvic.h>
#include <libopencm3/stm32/flash.h>
#include <libopencm3/stm32/timer.h>

#include <libopencm3/cm3/scb.h>

#include <libopencm3/stm32/pwr.h>
#include <libopencm3/stm32/exti.h>

#include "cstring"
#include "tinysh.h" 
#include "tinysh_setup.h" 
#include "nRF24L01P_Maniacbug.h"
#include "stm32_nrf.h" 

#include "epd_app.h" 


int atohc(char c);


void dng_fnt(int argc, char **argv);


void stm32_flash_read(void);
// uint32_t dbg_dosend = 0;

int channel = 88;
rf24_datarate_e _dataRate = RF24_250KBPS;
rf24_crclength_e _crcLength = RF24_CRC_8;

bool runState = true;
uint16_t sent_interval = 20;

uint16_t tracer = 0;


// ====================================================
// FLASH Settings struct
// ====================================================
// #define MY_FLASH_PAGE_ADDR 0x800FC00

#define MY_FLASH_PAGE_ADDR 0x08080000     // eeprom
#define EEPROM_DATA_ID 0xAA55

// const uint64_t pipes[2] = { 0xE8E8F0F0D1LL, 0xE8E8F0F0E1LL };
uint64_t pipes[2] = { 0xE8E8F0F0D1LL, 0xE8E8F0F0E1LL };

typedef struct {
    // id of the device -> max is 32 characters
    char id[16];
    // type of the device -> a simple int
    int16_t type;
    // table of value -> 8 values max
    int16_t val[7];
} Payload;

Payload ps;
Payload pr;

/* Morse standard timings */
#define ELEMENT_TIME 500
#define DIT (1*ELEMENT_TIME)
#define DAH (3*ELEMENT_TIME)
#define INTRA (1*ELEMENT_TIME)
#define INTER (3*ELEMENT_TIME)
#define WORD (7*ELEMENT_TIME)


uint16_t frequency_sequence[] = {
  DIT,
  INTRA,
  DIT,
  INTRA,
  DIT,
  INTER,
  DAH,
  INTRA,
  DAH,
  INTRA,
  DAH,
  INTER,
  DIT,
  INTRA,
  DIT,
  INTRA,
  DIT,
  WORD,
};

int frequency_sel = 0;

eeprom_Settings settings;

bool eeprom_SettingsValid = false;
 
static inline __attribute__((always_inline)) void __WFI(void)
{
  __asm volatile ("wfi");
}
 
static void clock_setup(void)
{
	/* Enable GPIOA clock . */
	rcc_periph_clock_enable(RCC_GPIOA);

	/* Enable clocks for USART1. */
	rcc_periph_clock_enable(RCC_USART1);
  rcc_clock_setup_msi(&rcc_clock_config[RCC_CLOCK_VRANGE1_MSI_RAW_2MHZ]);

  // rcc_clock_setup_msi(&rcc_clock_config[RCC_CLOCK_VRANGE1_MSI_RAW_131KHZ]);

}


static void usart_setup(void)
{
	/* Enable the USART1 interrupt. */
  // review
	nvic_enable_irq(NVIC_USART1_IRQ);

	/* Setup GPIO pins for USART1 transmit. */
	gpio_mode_setup(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO9);

	/* Setup GPIO pins for USART1 receive. */
	gpio_mode_setup(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO10);
	// gpio_set_output_options(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_25MHZ, GPIO10);

	/* Setup USART1 TX and RX pin as alternate function. */
	gpio_set_af(GPIOA, GPIO_AF4, GPIO9);
	gpio_set_af(GPIOA, GPIO_AF4, GPIO10);

	/* Setup USART1 parameters. */
  // usart_set_baudrate(USART1, 115200);
  // usart_set_baudrate(USART1, 9600);
  usart_set_baudrate(USART1, 19200);
	usart_set_databits(USART1, 8);
	usart_set_stopbits(USART1, USART_STOPBITS_1);
	usart_set_mode(USART1, USART_MODE_TX_RX);
	usart_set_parity(USART1, USART_PARITY_NONE);
	usart_set_flow_control(USART1, USART_FLOWCONTROL_NONE);

	/* Enable USART1 Receive interrupt. */
	usart_enable_rx_interrupt(USART1);

	/* Finally enable the USART. */
	usart_enable(USART1);
}

static void gpio_setup(void)
{
	/* Setup GPIO pin GPIO8 on GPIO port D for LED. */
	gpio_mode_setup(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO0 |  GPIO1 |GPIO8);
}


uint16_t adc_setup(void)
{

  // uint8_t channel_array[18];
  // channel_array[0] = ADC_CHANNEL_TEMP;
  // channel_array[0] = ADC_CHANNEL_VREF;

  rcc_peripheral_enable_clock(&RCC_APB2ENR, RCC_APB2ENR_ADC1EN);

  rcc_periph_clock_enable(RCC_ADC1);

  adc_set_clk_source(ADC1,ADC_CFGR2_CKMODE_PCLK);
  // rcc_periph_clock_enable(RCC_GPIOA);

  adc_enable_lfmode();
  print_s_hex32("adc cr 0  ",getADC_CR() );


  // seems only a reset can put the ADC_CR into 0 
  uint32_t to = adc_clear_cr();
  print_s_hex32("adc clear timeout   ",(uint32_t)to );

  // print_s_hex32("RCC_APB2ENR   ",(uint32_t)getRCC_APB2ENR() );
  // print_s_hex32("adc cr address  ",(uint32_t)adc_cr(ADC1) );

  print_s_hex32("adc cr 1  ",getADC_CR() );
  print_s_hex32("adc ISR 1  ",getADC_ISR() );
   print_s_hex32("adc CALF 1  ",getADC_CALFACT() );

   // for testing 
  adc_eocal_interrupt();
  adc_calibrate(ADC1);
  // power off for calib
  // uint16_t ct = adc_calibrate(ADC1);
  // print_s_decimal((char *)"cal timeout ",ct);

#ifdef DEBUG
  print_s_hex32("adc cr 2  ",getADC_CR() );
  print_s_hex32("adc ISR 2  ",getADC_ISR() );
   print_s_hex32("adc CALF 2  ",getADC_CALFACT() );
#endif

  println( adc_is_power_off(ADC1) ? (char *)"adc power off" : (char *)"adc power on" );
  // uint16_t u =  adc_power_off(ADC1);
  adc_power_off(ADC1);

  // print_s_decimal((char *) "timeout ",u);

  adc_set_single_conversion_mode(ADC1);

  println((char *)"adc_setup 2");
  // adc_set_operation_mode(ADC1, ADC_MODE_SCAN);
  // adc_disable_external_trigger_regular(ADC1);
  adc_set_right_aligned(ADC1);

  
