esch/STM32L052-examples/STM32_nrf/stm32_nrf.cpp
    // adc_enable_temperature_sensor();
    // adc_enable_chan(ADC_CHANNEL18);


  // adc_set_sample_time_on_all_channels(ADC1, ADC_SMPR_SMP_160DOT5);
  adc_set_sample_time_on_all_channels(ADC1, ADC_SMPR_SMP_079DOT5);
  
  // adc_set_regular_sequence(ADC1, 1, channel_array);


  adc_set_resolution(ADC1, ADC_CFGR1_RES_12_BIT);
  adc_disable_analog_watchdog(ADC1);


  adc_power_on(ADC1);

print_s_hex32("adc cr 4  ",getADC_CR() );


return 0;
  /* Wait for ADC starting up. */
  // int i;
  // for (i = 0; i < 800000; i++) {    /* Wait a bit. */
  //   __asm__("nop");
  // }

}


static void tim_setup(void)
{
  /* Enable TIM2 clock. */
  rcc_periph_clock_enable(RCC_TIM2);

  /* Enable TIM2 interrupt. */
  nvic_enable_irq(NVIC_TIM2_IRQ);

  /* Reset TIM2 peripheral to defaults. */
  rcc_periph_reset_pulse(RST_TIM2);

  /* Timer global mode:
   * - No divider
   * - Alignment edge
   * - Direction up
   * (These are actually default values after reset above, so this call
   * is strictly unnecessary, but demos the api for alternative settings)
   */
  timer_set_mode(TIM2, TIM_CR1_CKD_CK_INT,
    TIM_CR1_CMS_EDGE, TIM_CR1_DIR_UP);

  /*
   * Please take note that the clock source for STM32 timers
   * might not be the raw APB1/APB2 clocks.  In various conditions they
   * are doubled.  See the Reference Manual for full details!
   * In our case, TIM2 on APB1 is running at double frequency, so this
   * sets the prescaler to have the timer run at 5kHz
   */
  timer_set_prescaler(TIM2, ((rcc_apb1_frequency * 2) / 5000));

  /* Disable preload. */
  timer_disable_preload(TIM2);
  timer_continuous_mode(TIM2);

  /* count full range, as we'll update compare value continuously */
  // timer_set_period(TIM2, 65535);
  timer_set_period(TIM2, 6553);
  // timer_set_period(TIM2, 3655);
  // timer_set_period(TIM2, 1055);

  /* Set the initual output compare value for OC1. */
  timer_set_oc_value(TIM2, TIM_OC1, frequency_sequence[frequency_sel++]);

  /* Counter enable. */
  timer_enable_counter(TIM2);

  /* Enable Channel 1 compare interrupt to recalculate compare values */
  timer_enable_irq(TIM2, TIM_DIER_CC1IE);
}

void tim2_isr(void)
{
  if (timer_get_flag(TIM2, TIM_SR_CC1IF)) {

    /* Clear compare interrupt flag. */
    timer_clear_flag(TIM2, TIM_SR_CC1IF);

    /*
     * Get current timer value to calculate next
     * compare register value.
     */
    // uint16_t compare_time = timer_get_counter(TIM2);

    // /* Calculate and set the next compare value. */
    // uint16_t frequency = frequency_sequence[frequency_sel++];
    // uint16_t new_time = compare_time + frequency;

    timer_set_oc_value(TIM2, TIM_OC1, 500);
    // if (frequency_sel == ARRAY_LEN(frequency_sequence)) {
    //  frequency_sel = 0;
    // }

    /* Toggle LED to indicate compare event. */
    gpio_toggle(GPIOA, GPIO8);
  }
}

void enter_Standby( void )  // 200 nA 
{
    /* Enable Clocks */
    RCC_APB1ENR |= RCC_APB1ENR_PWREN;
    RCC_APB2ENR = 0 ;
    RCC_AHBRSTR  = 0;
     
    /* Prepare for Standby */
    // if WKUP pins are already high, the WUF bit will be set
    PWR_CSR |= PWR_CSR_EWUP1 | PWR_CSR_EWUP2;
     
    PWR_CR |= PWR_CR_CWUF; // clear the WUF flag after 2 clock cycles
    PWR_CR |= PWR_CR_ULP;   // V_{REFINT} is off in low-power mode
    PWR_CR |= PWR_CR_PDDS; // Enter Standby mode when the CPU enters deepsleep
     

//   print_s_hex32("RTC CR ",getRTC_CR() );
//   print_s_hex32("RTC ISR ",getRTC_ISR() );
//   print_s_hex32("RTC PRER ",getRTC_PRER() );
//   print_s_hex32("RTC WUTR ",getRTC_WUTR() );
//   print_s_hex32("RTC TAFCR ",getRTC_TAFCR() );
//   print_s_hex32("RTC APB1ENR ",getRCC_APB1ENR() );
//   print_s_hex32("RTC CCIPR ",getRCC_CCIPR() );

// wait(2);
    SCB_SCR |= SCB_SCR_SLEEPDEEP; // low-power mode = stop mode
    SCB_SCR |= SCB_SCR_SLEEPONEXIT; // reenter low-power mode after ISR

    __WFI(); // enter low-power mode
}


void enter_Sleep( void )  // about 35 uA with 131 KHz clock - powerRange1 - 
{
    /* Configure low-power mode */
  SCB_SCR &= ~( SCB_SCR_SLEEPDEEP );
  SCB_SCR |= SCB_SCR_SLEEPONEXIT;
     
    /* Ensure Flash memory stays on */
    FLASH_ACR |= FLASH_ACR_SLEEPPD;

    __WFI();  // enter low-power mode
}


void enter_LPSleep( void )  // about 20 uA 131 KHz clock
{
    /* 1. The Flash memory can be switched off by using the control bits
              (SLEEP_PD in the FLASH_ACR register). This reduces power consumption
              but increases the wake-up time. */
    // FLASH->ACR |= FLASH_ACR_SLEEP_PD;
    FLASH_ACR |= FLASH_ACR_SLEEPPD;

    /* 2. Each digital IP clock must be enabled or disabled by using the
                RCC_APBxENR and RCC_AHBENR registers */
    // RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    RCC_APB1ENR |= RCC_APB1ENR_PWREN;

    /* 3. The frequency of the system clock must be decreased to not exceed the
                frequency of f_MSI range1. */
    // Set MSI 131.072 kHz as system clock
    // Config_SysClk_MSI_131();

    rcc_clock_setup_msi(&rcc_clock_config[RCC_CLOCK_VRANGE1_MSI_RAW_131KHZ]);


    // Reinitialize peripherals dependent on clock speed
    // USART1_Init();
    // SysTick_Init( 0.001 );
    // I2C1_Init();

      flash_unlock_pdkey();

    /* 4. The regulator is forced in low-power mode by software
                (LPSDSR bits set ) */
    // PWR->CR |= PWR_CR_LPSDSR; // voltage regulator in low-power mode during sleep
  pwr_low_power();


    /* 5. Follow the steps described in Section 6.3.5: Entering low-power mode */
    // SCB->SCR &= ~( SCB_SCR_SLEEPDEEP_Msk ); // low-power mode = sleep mode
    // SCB->SCR |= SCB_SCR_SLEEPONEXIT_Msk; // reenter low-power mode after ISR
  SCB_SCR &= ~( SCB_SCR_SLEEPDEEP );
  SCB_SCR |= SCB_SCR_SLEEPONEXIT;


    __WFI(); // enter low-power mode
}

/* Temperature sensor calibration value address */
#define TEMP130_CAL_ADDR ((uint16_t*) ((uint32_t) 0x1FF8007E))
#define TEMP30_CAL_ADDR ((uint16_t*) ((uint32_t) 0x1FF8007A))
#define VDD_CALIB ((uint16_t) (300))
#define VDD_APPLI ((uint16_t) (330))

#define VREFINT_CAL_ADDR ((uint16_t*) ((uint32_t)0x1FF80078))

int real_VDD = VDD_APPLI;


int32_t ComputeTemperature(uint32_t measure)
{
int32_t temperature;

  temperature = ((measure * real_VDD * (int32_t)100/ VDD_CALIB)- ((int32_t) *TEMP30_CAL_ADDR) * 100)  ;
  temperature = temperature  * (int32_t)(130 - 30);
  temperature = temperature / (int32_t)(*TEMP130_CAL_ADDR - *TEMP30_CAL_ADDR);
  temperature +=  3000;

  return(temperature);
}



