esch/STM32L052-examples/STM32_nrf/stm32_nrf.cpp
void readTempADC(void) {
  uint16_t temp;
  
    adc_enable_temperature_sensor();
    adc_enable_chan(ADC_CHANNEL18);
    wait_ms(20);

    if(settings.dbg > 0) {
      println("------ temp sensor -----------");
      print_s_hex32("adc cr 1  ",getADC_CR() );

      print_s_hex32("adc cfgr1  ",getADC_CFGR1() );
      print_s_hex32("adc chselr  ",getADC_CHSELR() );
      print_s_hex32("adc dr  ",getADC_DR() );
    }

    adc_start_conversion_regular(ADC1);
    while (!(adc_eoc(ADC1)));
    if(settings.dbg > 0) print_s_hex32("adc dr 1 ",getADC_DR() );

    temp = adc_read_regular(ADC1);    
    if(settings.dbg > 0) print_s_decimal("temp sensor raw ", temp);

    int32_t celc = ComputeTemperature(temp);
    ps.val[4] = celc;
    if(settings.dbg > 0) print_s_decimal("temp sensor  ", celc);

    adc_disable_temperature_sensor();
    adc_disable_chan(ADC_CHANNEL18);
    if(settings.dbg > 0) println("------ ----------------- -----------");
}


// why do we have only 330 as voltage read ?
// can we set the init of the ADC

void readVREFADC(void) {
  uint16_t vref;

    adc_enable_vrefint();
    adc_enable_chan(ADC_CHANNEL17);
    if(settings.dbg > 0) {
      println("------ vref sensor -----------");

      print_s_hex32("adc cfgr1  ",getADC_CFGR1() );
      print_s_hex32("adc chselr  ",getADC_CHSELR() );
      print_s_hex32("adc dr  ",getADC_DR() );
    }

    adc_start_conversion_regular(ADC1);
    while (!(adc_eoc(ADC1)));
    if(settings.dbg > 0) print_s_hex32("adc dr 1 ",getADC_DR() );

    vref = adc_read_regular(ADC1);    
    if(settings.dbg > 0) print_s_decimal("vref raw ", vref);

    int32_t VDD;

      VDD =   300 * (*VREFINT_CAL_ADDR)/vref;
    if(settings.dbg > 0) print_s_decimal("VDD  ", VDD);
    real_VDD = VDD;

    // ps.val[0] = VDD;

    adc_disable_vrefint();
    adc_disable_chan(ADC_CHANNEL17);
    if(settings.dbg > 0) println("------ ----------------- -----------");

    // return VDD;
}


void rtc_awwake(void ) 
{

  // print_s_hex32("RCC CSR 0 ",getRCC_CSR() ); // check if we need to enable ??

  uint32_t rts = rcc_enable_rtc_clock();
  // print_s_hex32("rtc enable ", rts );

  // print_s_hex32("RCC ",getRCC_CSR() ); // check if we need to enable ??
    // print_s_hex32("RTC_TR 3 ", getRTC_TR() );

  // print_s_hex32(" pwr cr (enabled ?) ", getPWR_CR() );

     // print_s_hex32("RTC_TR 4 ", getRTC_TR() );

// if(!init) 
  rcc_set_rtc_clock_source( RCC_LSI );

  rcc_osc_ready_int_clear( RCC_LSI );
// wait_ms(500);

  // print_s_hex32("RTC_TR ", getRTC_TR() );
  // print_s_hex32("RCC CSR ",getRCC_CSR() );

  rtc_unlock();

// if(!init) {
  // println("init rtc ...");
  // print_s_hex32("RTC_TR 5", getRTC_TR() );
  rtc_start_init();

 // prescaler setting for 1 HZ on the LSI clock
  rtc_set_prescaler(295,124);
  rtc_exit_init();
  // }

// 
  // rtc_set_wakeup_time( 0x10 /* [sec]*/ ,RTC_CR_WUCLKSEL_SPRE ); // 

  uint32_t si = (settings.sent_interval ) ? settings.sent_interval : 0x10; 
  rtc_set_wakeup_time( si /* [sec]*/ ,RTC_CR_WUCLKSEL_SPRE ); // 

  rtc_enable_wakeup_irq();
  rtc_wait_for_synchro();
  rtc_lock();




  exti_set_trigger(EXTI20,EXTI_TRIGGER_RISING);
  exti_enable_request(EXTI20);


}

void rtc_isr(void)
{
  /* The interrupt flag isn't cleared by hardware, we have to do it. */
  rtc_clear_wakeup_flag();
  rtc_disable_wakeup_irq();

  // rtc_clear_flag(RTC_SEC);
  // rcc_clock_setup_msi(&rcc_clock_config[RCC_CLOCK_VRANGE1_MSI_RAW_131KHZ]);
  // rcc_clock_setup_msi(&rcc_clock_config[RCC_CLOCK_VRANGE1_MSI_RAW_2MHZ ]);

  // gpio_setup();
    clock_setup();
  gpio_setup();
  usart_setup();
 
  /* Visual output. */
  int y = 8;

  while(y--) {
    for(int h=0;h<88;h++)
      __asm__("NOP");

    gpio_toggle(GPIOA, GPIO8);
  }

gpio_set(GPIOA, GPIO8);
nvic_disable_irq(NVIC_RTC_IRQ);
    // scb_reset_system();
}


RF24 radio;    // mosi, miso, sck, csn (SSEL), ce, irq

time_t seconds;

uint8_t tt;

static uint32_t slc = 0;

// #define RADIOON 1

bool go_sleep = false; 

void sleepLoop(void) {

  while(1) {
    if(go_sleep) {
      go_sleep = false;

        rtc_awwake();

        // uint32_t bck = getRTC_BKPXR(0);
        // setRTC_BKPXR(0, (nrst ? 0 : bck+1) );
        // setRTC_BKPXR(1, settings.sent_interval );
        // setRTC_BKPXR(2, pr.val[1] );

        rcc_clock_setup_msi(&rcc_clock_config[RCC_CLOCK_VRANGE1_MSI_RAW_131KHZ]);

        wait_ms(2);
        nvic_enable_irq(NVIC_RTC_IRQ);
        wait_ms(2);

        // enter_Standby( );
        enter_Sleep();


    }
    else
      __asm__("NOP");

  }

}


int main(void)
{

	clock_setup();
	gpio_setup();
	usart_setup();
 uint16_t as = adc_setup();  // 0 unsuccessfull

 // if(!as) scb_reset_system();

  // tim_setup();

  // read settings from eeprom
  stm32_flash_read();

  if( !eeprom_SettingsValid) {  // we take the default values
    println("init flash data");
    settings.ID = EEPROM_DATA_ID;
    settings.s_channel = channel;
    settings.pipeWr = pipes[0];
    settings.pipeRd = pipes[1];
    settings.sCrc = _crcLength;
    settings.sDrate = _dataRate;
    settings.sent_interval = sent_interval;

  }
  tracer = 1;
    
  // the input is captured in the ISR
  tinyshell_thread(); 
  // sleepLoop();


    int cc = 10;

#ifdef NOEPD
  setup_ep();
#endif


  // get reset info

  bool nrst = false;
  uint32_t csr =  getRCC_CSR();
  print_s_hex32("reset ? ", csr );

  if(getRTC_BKPXR(2) & 0x1) cc = 0;

  if( csr & RCC_CSR_PINRSTF ) {
    println("reset - NRST ");
    cc = 10;
    nrst = true;
  }
  else if( csr & 0xff000000 )
    println("reset - active ");

  rcc_clear_int();

    println((char *)"This is a stm32 nrf24 - ep  implementation +-+\n");
  // print_s_hex32("RCC ",getRCC_CSR() );

  uint32_t rtcv = getRTC_TR();
  // print_s_hex32("RTC_TR 1 ", rtcv );
  // print_s_hex32("RTC_TSTR ", getRTC_TSTR() );

    while(cc--) {
        gpio_set(GPIOA,GPIO8);
        wait_ms(200);
        gpio_clear(GPIOA,GPIO8);
        wait_ms(200);
    }
        gpio_set(GPIOA,GPIO8);

    // gpio_set(GPIOA,GPIO0);
    // gpio_clear(GPIOA,GPIO0);
    // gpio_set(GPIOA,GPIO0);

// #ifdef RADIOON 
      tracer = 2;

    println((char *)"Start radio ....");

    radio.begin();

    initRadio();
// #endif
   // radio.printDetails();
    
    println((char *)"Start setup done...");

