esch/STM32L052-examples/STM32_nrf/stm32_nrf.cpp
    ps.id[0] = 5;
    for (int i=1; i < 16; i++) {
        ps.id[i] = 0;
    }

    ps.type = 6;
    for (int i=0; i < 7; i++) {
        ps.val[i] = i*i;
    }


    // radio.powerUp();

    println((char *)"power up done  .....--");

    uint8_t timeout=8;
    // gpio_set(GPIOA,GPIO0);
    // gpio_clear(GPIOA,GPIO0);
    // gpio_set(GPIOA,GPIO0);

    settings.sent_interval = getRTC_BKPXR(1);

    while(1) {

      tracer = 3;

// #ifdef RADIOON      
        radio.stopListening();

        ps.val[1] = getRTC_BKPXR(0);

        ps.val[3] = (int16_t) settings.sent_interval;

        radio.powerUp();
// #endif        

        if(!as) println("adc_setup failed");

        if(as) readTempADC();

        wait_ms(200);
        // ps.val[0] = readVREFADC();
        if(as)readVREFADC();
      // println("awake s");
        ps.val[0] = real_VDD;


// #ifdef RADIOON 
        // gpio_clear(GPIOA,GPIO8);
        // Send to hub
        if ( radio.write(&ps, sizeof(ps)) ) {

           // if( !debug ) print((char *)"Send successfull \n\r");
        } else {

           // if( !debug ) print((char *)"Send failed \n\r");
//            break; // we can give up this try and go sleeping
        }
        // gpio_set(GPIOA,GPIO8);

        //wait response


        wait_ms(100);

        radio.startListening();
        // for(int f = 0;f<4; f++) {
        //   uint8_t stat = radio.get_status();
        //   print_s_hex8("status ",stat );
        //   wait_ms(500);
        // }
        wait_ms(300);


        println("listening ..");
          do {
            uint8_t len = radio.getDynamicPayloadSize();

            print_s_decimal("payload size ??? ",len);
            print_s_decimal("read size ", sizeof(pr));

            if( radio.available() ) {
              radio.powerDown();

              radio.read( &pr, sizeof(pr));
              print_s_decimal("val rec 0: ", pr.val[0] );
              if( pr.val[0] < 120 && pr.val[0] > 4 )
                  settings.sent_interval = pr.val[0];

              print_s_decimal("interval 0: ", settings.sent_interval );

              print_s_hex32("val rec 1: 0x", pr.val[1] );


              print_s_decimal("val rec 2: ", pr.val[2] );
              break;
            }
            else
              wait_ms(100);

        } while ( --timeout );
// #endif
print_s_decimal("timeout ",timeout);
        // ?? review  

	rtc_awwake();

  uint32_t bck = getRTC_BKPXR(0);

        if(!timeout) {
            radio.stopListening();
            radio.powerDown();
          }
        else {
          setRTC_BKPXR(0, (nrst ? 0 : bck+1) );
          setRTC_BKPXR(1, settings.sent_interval );
          setRTC_BKPXR(2, pr.val[1] );
        }


  rcc_clock_setup_msi(&rcc_clock_config[RCC_CLOCK_VRANGE1_MSI_RAW_131KHZ]);



        wait_ms(2);
	nvic_enable_irq(NVIC_RTC_IRQ);
        wait_ms(2);

	enter_Standby( );
         tracer = 4;
  // enter_Sleep();
// #endif
      tracer = 5;

  // rcc_clock_setup_msi(&rcc_clock_config[RCC_CLOCK_VRANGE1_MSI_RAW_2MHZ ]);
  // clock_setup();
  // gpio_setup();
  // usart_setup();
println("woke up ");



#ifdef NOEPD
        loop_ep();
#endif        

        // wait(settings.sent_interval);

    }

	return 0;
}


static uint8_t data = 0xff;
static uint8_t char_[0];

void listRadio(void) {
    radio.printDetails();
}

void initRadio(void) {

    println((char *)"init Radio ...");

    // Enable this seems to work better
    radio.enableDynamicPayloads();
    radio.setAutoAck(false);
    radio.setDataRate( (rf24_datarate_e )settings.sDrate);
//  radio.setPALevel(RF24_PA_MAX);
    radio.setChannel(settings.s_channel);
    radio.setRetries(15,15);
    radio.setCRCLength( (rf24_crclength_e )settings.sCrc);


    radio.openWritingPipe(settings.pipeWr);
    radio.openReadingPipe(1,settings.pipeRd);

}


void wait(uint32_t t) {

      wait_ms(1000*t);
}


void wait_ms(uint32_t t) {

        for(uint32_t x = 0;x< 340*t;x++)
        __asm__("NOP");

}



uint8_t *ugetc(void) {
	bool nc = false;


	if( data != 0xff ) {
		*char_ =  data;
		nc = true;
		data = 0xff;
	}

	return (nc) ? char_ : NULL;
	
}

void uputc(uint8_t c) {
	usart_send_blocking(USART1, c);

}


void usart1_isr(void)
{

  // usart_disable_rx_interrupt(USART1);
  nvic_disable_irq(NVIC_USART1_IRQ);


	/* Check if we were called because of RXNE. */
	if (((USART_CR1(USART1) & USART_CR1_RXNEIE) != 0) &&
	    ((USART_ISR(USART1) & USART_SR_RXNE) != 0)) {

		/* Indicate that we got data. */
		// gpio_toggle(GPIOA, GPIO8);

		/* Retrieve the data from the peripheral. */
		data = usart_recv(USART1);

		tinysh_char_in( data );
		/* Enable transmit interrupt so it sends back the data. */
		// usart_enable_tx_interrupt(USART1);
	}
  nvic_enable_irq(NVIC_USART1_IRQ);

}






////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
/////// TINY SHELL EXAMPLE AS THREAD ///////////////////////////

static  char *cmds [] = {
                        (char *)"Syntax: help",
                        (char *)"Function:",
                        (char *)"  'help'  print this help info",
                        (char *)"  'dbg'  ",
                        };

int nItems = (sizeof(cmds)/sizeof(cmds[0]));



void tinysh_char_out(uint8_t c)
{
    uputc(c);
}


////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
bool debug = true;


void print(char *s)
{

    if(debug) {
        for(unsigned int x =0; x<strlen((char *)s); x++)
            uputc(s[x]);
    }
}

void println(char *s)
{
    print(s);
    print((char *)"\r\n");
}



void tinysh_puts(uint8_t *s)
{

    for(unsigned int x =0; x<strlen((char *)s); x++)
       uputc(s[x]);
}


