esch/STM32L052-examples/STM32_nrf/stm32_nrf.cpp
void print_hex8_(uint8_t v) {
    int i, h;
    for (i = 4; i >= 0; i -= 4) {
        h = (v >> i) & 0x0f;
        if (h < 10) {
            uputc('0' + h);
        } else {
            uputc('A' + h - 10);
        }
    }
}

void print_hex8(uint8_t v) {
    uputc('0');
    uputc('x');

    print_hex8_(v);
}


void print_hex16(uint16_t v) {
    int i, h;
    uputc('0');
    uputc('x');

    for (i = 12; i >= 0; i -= 4) {
        h = (v >> i) & 0x0f;
        if (h < 10) {
            // usart_send_blocking(USART1,'0' + h);
            uputc('0' + h);
        } else {
            // usart_send_blocking(USART1,'A' + h - 10);
            uputc('A' + h - 10);
        }
    }
  uputc('\r');  
  uputc('\n');  
}

void print_hex32(uint32_t v) {
    int i, h;
    uputc('0');
    uputc('x');

    for (i = 28; i >= 0; i -= 4) {
        h = (v >> i) & 0x0f;
        if (h < 10) {
            uputc('0' + h);
        } else {
            uputc('A' + h - 10);
        }
    }

  uputc('\r');  
  uputc('\n');  
}


void print_hex64(uint64_t v) {
    int i, h;
    uputc('0');
    uputc('x');

    for (i = 60; i >= 0; i -= 4) {
        h = (v >> i) & 0x0f;
        if (h < 10) {
            uputc('0' + h);
        } else {
            uputc('A' + h - 10);
        }
    }

  uputc('\r');  
  uputc('\n');  
}

void print_decimal (int32_t i) {
    uint8_t buf[16];
    uint32_t j = 0;

    if (i == 0) {
        // usart_send_blocking(USART1,'0');
        uputc('0');
        return;
    }

    if (i < 0) {
        // usart_send_blocking(USART1,'-');
        uputc('-');
        i *= -1;
    }
    while (i > 0) {
        buf[j++] = '0' + i % 10;
        i /= 10;
    }
    while (j > 0) {
        // usart_send_blocking(USART1,buf[--j]);
        uputc(buf[--j]);
    }

}

void print_decimaln (int32_t i) {

  print_decimaln(i);
  // usart_send_blocking(USART1, '\r');
  // usart_send_blocking(USART1, '\n');
  uputc('\r');  
  uputc('\n');  


}


void print_s_decimal(char *s, int32_t i) {
    print(s);
    print_decimal(i);
    print((char *)"\r\n");

}

void print_s_hex8(char *s, int32_t i) {
    print(s);
    print_hex8(i);
    print((char *)"\r\n");

}

void print_s_hex32(char *s, int32_t i) {
    print(s);
    print_hex32(i);
    print((char *)"\r\n");

}

void print_s_hex64(char *s, int64_t i) {
    print(s);
    print_hex64(i);

}

void print_s_key(char *s, uint8_t *key,uint8_t nSize) {

    print(s);
    for(int i = 0;i<nSize;i++)
      print_hex8_(key[i]);
    println((char *)"");
}

// ascii to hex , single character
int atohc(char c) {

if(c>='A' && c<='F') return (c - 'A' + 10);
if(c>='a' && c<='f') return (c - 'a' + 10);
if(c>='0' && c<='9') return (c - '0');

return 0;
}



// ascii to hex for double character
int atoh(char *c) {
int v = 0;
for(int x=0;x<2;x++) 
  v+= (x==1)  ? atohc(c[x]):atohc(c[x])*16;

return v;
}



#define SETTINGS_WORDS sizeof(settings)/4

void FLASH_Init(void) {
  /* Next commands may be used in SysClock initialization function
     In this case using of FLASH_Init is not obligatorily */
  /* Enable Prefetch Buffer */
  // FLASH_PrefetchBufferCmd( FLASH_PrefetchBuffer_Enable);
  flash_prefetch_enable();
  /* Flash 2 wait state */
  flash_set_ws( FLASH_ACR_LATENCY_1WS );
  // FLASH_SetLatency( FLASH_Latency_2);
}

void FLASH_ReadSettings(void) {
  //Read settings
  uint32_t *source_addr = (uint32_t *)MY_FLASH_PAGE_ADDR;
  uint32_t *dest_addr = (uint32_t *)&settings;
  for (uint16_t i=0; i<SETTINGS_WORDS; i++) {
    *dest_addr = *(uint32_t*)source_addr;
    source_addr++;
    dest_addr++;
  }
}

void FLASH_WriteSettings(void) {
  // FLASH_Unlock();
  // flash_unlock();
  // FLASH_ErasePage(MY_FLASH_PAGE_ADDR);

  // Write settings
  uint32_t *source_addr = (uint32_t *)&settings;
  uint32_t *dest_addr = (uint32_t *) MY_FLASH_PAGE_ADDR;
  for (uint16_t i=0; i<SETTINGS_WORDS; i++) {

    // FLASH_ProgramWord((uint32_t)dest_addr, *source_addr);
    eeprom_program_word((uint32_t)dest_addr, *source_addr);
    source_addr++;
    dest_addr++;
  }
  // flash_lock();
  // FLASH_Lock();
}
// ====================================================


void stm32_flash_read(void) {
  FLASH_Init();
  FLASH_ReadSettings();
  if( settings.ID == EEPROM_DATA_ID ) {
    println((char *)"EEPROM_DATA_ID OK");
    eeprom_SettingsValid = true;
  }
  else {
    println((char *)"EEPROM_DATA_ID NOT OK");
    settings.ID = EEPROM_DATA_ID;
    eeprom_SettingsValid = false;
  }
}


void stm32_flash_write(void) {
  FLASH_Init();
  FLASH_WriteSettings();
}
